Revit 2027 API
BuiltInFailures.SketchFailures.ConvertSplineToLineFailed Property
 Failed to convert spline to straight line
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ConvertSplineToLineFailed { get; }
Public Shared ReadOnly Property ConvertSplineToLineFailed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ConvertSplineToLineFailed {
	FailureDefinitionId^ get ();
}
static member ConvertSplineToLineFailed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace